org/roam/gdb.org
:PROPERTIES:
:ID:       3d101bb5-0125-41bc-9678-e43487122c7d
:END:
#+title: gdb
#+OPTIONS: toc:nil num:nil date:nil \n:nil html-style:nil author:nil timestamp:nil title:nil html-postamble:nil html5-fancy:t
#+HTML_HEAD: <link rel="stylesheet" type="text/css" href="org-default.css" />
#+HTML_CONTENT_CLASS: container content
#+HTML_DOCTYPE: html5
#+INCLUDE: "css.org::navbar" :only-contents t

* GDB
** gdb
- python and guile interpreters
- tui mode with ~C-x 2~ (emacs like bindings)
- backtrace with ~bt~
- examine current with ~pc~ then ~x $1~
- step back one instruction ~reverse-step~
- loop program using breakpoints on main and exit with commands
#+NAME: gdb-script
#+BEGIN_SRC gdb :tangle no
break main
break _exit
command 1
record
continue
end
command 2
run
end
#+END_SRC
*** debug win32 app
- ~wine /usr/i686-w64-mingw32/bin/gdbserver.exe localhost:10000 ./some-win32.exe~ for tcp server
  - test connection with ~i686-w64-mingw32-gdb~ and ~target extended-remote 10000~ / ~file ./some-win32.exe~
  - when using ghidra use ~GADP~ for the connection or local gdb
