docs/gdb.html
<!DOCTYPE html>
<html lang="en">
<head>
<meta charset="utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>gdb</title>
<meta name="generator" content="Org Mode" />
<link rel="stylesheet" type="text/css" href="org-default.css" />
</head>
<body>
<div id="content" class="container content">
<nav class="navbar is-black" id="org0a7fbf0">
<div class="navbar-brand" id="org9ff046a">
<div class="navbar-item" id="org427efd5">
<p>
<a href="index.html#ID-3a34d6d7-6f37-4573-b20e-3c93894e54ac">🏠</a>
</p>

</div>

</div>
<div class="navbar-menu" id="org294faff">
<div class="navbar-start" id="org54bab2a">
<div class="navbar-item" id="orgdc549a3">
<p>
<a href="site_map.html#ID-30ea5e38-9b41-4bcd-8631-76821e93e294">🗺</a>
</p>

</div>

</div>
<div class="navbar-end" id="org570121c">

</div>

</div>
</nav>

<div id="outline-container-orgf984d27" class="outline-2">
<h2 id="orgf984d27">GDB</h2>
<div class="outline-text-2" id="text-orgf984d27">
</div>
<div id="outline-container-org22540aa" class="outline-3">
<h3 id="org22540aa">gdb</h3>
<div class="outline-text-3" id="text-org22540aa">
<ul class="org-ul">
<li>python and guile interpreters</li>
<li>tui mode with <code>C-x 2</code> (emacs like bindings)</li>
<li>backtrace with <code>bt</code></li>
<li>examine current with <code>pc</code> then <code>x $1</code></li>
<li>step back one instruction <code>reverse-step</code></li>
<li>loop program using breakpoints on main and exit with commands</li>
</ul>
<div class="org-src-container">
<pre class="src src-gdb" id="org4a7b04e">break main
break _exit
command 1
record
continue
end
command 2
run
end
</pre>
</div>
</div>
<div id="outline-container-orgf41a026" class="outline-4">
<h4 id="orgf41a026">debug win32 app</h4>
<div class="outline-text-4" id="text-orgf41a026">
<ul class="org-ul">
<li><code>wine /usr/i686-w64-mingw32/bin/gdbserver.exe localhost:10000 ./some-win32.exe</code> for tcp server
<ul class="org-ul">
<li>test connection with <code>i686-w64-mingw32-gdb</code> and <code>target extended-remote 10000</code> / <code>file ./some-win32.exe</code></li>
<li>when using ghidra use <code>GADP</code> for the connection or local gdb</li>
</ul></li>
</ul>
</div>
</div>
</div>
</div>
</div>
</body>
</html>